In [1]:
import pandas as pd
import os
import datetime

In [2]:
my_path = '/Users/texiagonzalezcaceres/Desktop/test_destacame/data'

In [3]:
print(os.listdir(my_path))

['quotation_activity.csv', '.DS_Store', 'df_report.csv', 'payment_offer.csv', 'financial_profile.csv', 'accounts_profile.csv']

In [4]:
df_accounts_profile = pd.read_csv('/Users/texiagonzalezcaceres/Desktop/test_destacame/data/accounts_profile.csv')
df_financial_profile = pd.read_csv('/Users/texiagonzalezcaceres/Desktop/test_destacame/data/financial_profile.csv')
df_quotation_activity = pd.read_csv('/Users/texiagonzalezcaceres/Desktop/test_destacame/data/quotation_activity.csv')
df_payment_offer = pd.read_csv('/Users/texiagonzalezcaceres/Desktop/test_destacame/data/payment_offer.csv')

In [5]:
df_accounts_profile.fillna(0, inplace=True)
df_financial_profile.fillna(0, inplace=True)
df_quotation_activity.fillna(0, inplace=True)
df_payment_offer.fillna(0, inplace=True)

In [6]:
df_accounts_profile.head(4)

,id,birthday,gender,country_id,date_joined,last_login
0,3073478,1985-04-27,f,1.0,2018-10-06 20:48:00,2018-10-06 23:48:01
1,3073481,0,0,2.0,2018-10-06 20:55:08,2018-10-07 11:57:43
2,3073484,1983-01-06,m,1.0,2018-10-06 20:55:20,2018-10-06 23:56:43
3,3073487,1991-09-07,m,1.0,2018-10-06 20:58:03,2018-10-06 23:58:03

In [7]:
df_financial_profile.head(4)

   user_id  salary  seniority employment_status  has_checking_account  entry
0  3073478     0.0         -1                 0                     0      0
1  3073487     0.0         -1                 0                     0      0
2  3073490     0.0         -1                 0                     0      0
3  3073496     0.0         -1                 0                     0      0

In [8]:
df_quotation_activity.head(4)

   user_id  product              created
0   568997       99  2018-10-06 21:03:08
1  2457644       31  2018-10-06 21:03:47
2  3071309      107  2018-10-06 21:12:13
3  3059822      116  2018-10-06 21:28:28

In [9]:
df_payment_offer.head(4)

   user_id        product                     created
0   492230  total_payment  2018-10-06 22:24:59.961338
1  3073430  total_payment  2018-10-06 23:20:09.566285
2  2064071  total_payment  2018-10-06 23:35:40.316639
3   733463  total_payment  2018-10-06 23:49:11.094730

# Quantity by gender

#### Recupera la cantidad de usuarios, agrupado por género

In [31]:
quantity_gender = df_accounts_profile.gender.value_counts()
quantity_gender = quantity_gender.to_frame()
quantity_gender.rename(index={'m': 'male', 0: 'unknown', 'f': 'female'}, inplace=True)
quantity_gender

         gender
male     112945
unknown   76001
female    74490

# Quantity by country

#### Recupera la cantidad de usuarios, agrupado por país

In [11]:
quantity_country = df_accounts_profile.country_id.value_counts()
quantity_country = quantity_country.to_frame()
quantity_country

     country_id
1.0      169408
2.0       93910
0.0         118

# Quantity by employment_status

#### Recupera la cantidad de usuarios, agrupado por employment_status

In [12]:
quantity_employment = df_financial_profile.employment_status.value_counts()
quantity_employment = quantity_employment.to_frame()
quantity_employment.rename(index= {0: 'unknown'}, inplace=True)
quantity_employment

             employment_status
unknown                 119833
employed                 39607
employer                  8914
independent               3762
unemployed                1650
student                    929
family                     438
retired                    382

# Quantity by salary

#### Recupera la cantidad de usuarios, agrupado por salary

In [13]:
quantity_salary = df_financial_profile.salary.value_counts()
quantity_salary = quantity_salary.to_frame()
quantity_salary

     salary
0.0  119833
4.0   18348
3.0   16352
5.0    8875
6.0    4553
2.0    4388
1.0    1197
7.0    1089
8.0     880

# Most traded product

#### Recupera la cantidad de productos mas transado

In [14]:
quantity_most_traded = df_payment_offer['product'].value_counts().max()
product_most_traded = df_payment_offer['product'].mode()

print('The most traded product is: {} which has been selected {} times'.format(product_most_traded[0],quantity_most_traded))

The most traded product is: total_payment which has been selected 7031 times

# Adding field "age" in profile data

#### Crear campo edad dentro de los datos del profile

In [15]:
df_accounts_profile['birthday'] = pd.to_datetime(df_accounts_profile['birthday'], errors = 'coerce')

In [16]:
today = datetime.date.today()

df_accounts_profile['age'] = df_accounts_profile['birthday'].apply(
    lambda x: today.year - x.year - 
    ((today.month, today.day) < (x.month, x.day)) 
)

In [17]:
df_accounts_profile['age'].fillna(0, inplace=True)
df_accounts_profile['age'] = df_accounts_profile['age'].astype(int)

In [18]:
df_accounts_profile.head(5)

,id,birthday,gender,country_id,date_joined,last_login,age
0,3073478,1985-04-27,f,1.0,2018-10-06 20:48:00,2018-10-06 23:48:01,35
1,3073481,1970-01-01,0,2.0,2018-10-06 20:55:08,2018-10-07 11:57:43,51
2,3073484,1983-01-06,m,1.0,2018-10-06 20:55:20,2018-10-06 23:56:43,38
3,3073487,1991-09-07,m,1.0,2018-10-06 20:58:03,2018-10-06 23:58:03,29
4,3073490,1990-05-23,f,1.0,2018-10-06 21:03:19,2018-10-07 00:04:58,30

# Adding field "age_range" in profile data

#### Crear campo de rango de edades dentro de los datos del profile 
#### (values = ('0-10', '10-20', '20-30', '30-40', '40-50', '50-60', '60-70', '70-80', '80-90'))

In [19]:
df_accounts_profile['age_range'] = pd.cut(
    x=df_accounts_profile['age'] , 
    bins=[0, 10, 20, 30, 40, 50, 60, 70, 80, 90], 
    labels=[
        '0-10', 
        '10-20', 
        '20-30', 
        '30-40', 
        '40-50', 
        '50-60', 
        '60-70', 
        '70-80', 
        '80-90',
    ], 
    right=False,
)

In [20]:
df_accounts_profile.head(5)

,id,birthday,gender,country_id,date_joined,last_login,age,age_range
0,3073478,1985-04-27,f,1.0,2018-10-06 20:48:00,2018-10-06 23:48:01,35,30-40
1,3073481,1970-01-01,0,2.0,2018-10-06 20:55:08,2018-10-07 11:57:43,51,50-60
2,3073484,1983-01-06,m,1.0,2018-10-06 20:55:20,2018-10-06 23:56:43,38,30-40
3,3073487,1991-09-07,m,1.0,2018-10-06 20:58:03,2018-10-06 23:58:03,29,20-30
4,3073490,1990-05-23,f,1.0,2018-10-06 21:03:19,2018-10-07 00:04:58,30,30-40

# Creating df_quotation_account

#### Unir tabla quotation y account

In [21]:
df_quotation_account = pd.merge(
    df_accounts_profile, 
    df_quotation_activity, 
    left_on='id', 
    right_on='user_id',
)

In [22]:
df_quotation_account.drop(
    columns='id', 
    inplace=True,
)

In [23]:
df_quotation_account.head(5)

,birthday,gender,country_id,date_joined,last_login,age,age_range,user_id,product,created
0,1992-09-12,m,2.0,2018-10-06 21:23:52,2018-11-06 00:22:12,28,20-30,3073529,116,2018-10-07 00:35:19
1,1988-08-06,m,2.0,2018-10-06 22:13:18,2018-10-07 01:13:19,32,30-40,3073586,58,2018-10-07 01:17:37
2,1993-04-08,f,1.0,2018-10-06 22:18:25,2018-10-10 13:10:02,27,20-30,3073595,99,2018-10-07 18:31:22
3,1992-10-23,f,2.0,2018-10-06 22:31:39,2019-02-01 20:48:47,28,20-30,3073604,58,2018-10-07 02:03:20
4,1974-02-04,f,2.0,2018-10-07 01:20:23,2018-10-07 04:29:14,46,40-50,3073658,58,2018-10-07 04:38:50

# Creating df_qaf

#### Unir tabla quotation, account y financial

In [24]:
df_qaf =  pd.merge(
    pd.merge(
        df_accounts_profile,
        df_quotation_activity,
        left_on='id',
        right_on='user_id'
    ), 
    df_financial_profile, on='user_id',
)

In [25]:
df_qaf =  pd.merge(
    df_quotation_account, 
    df_financial_profile, 
    on='user_id',
)

# Changing to datetime

#### Cambiar el tipo de dato de created y date_joined a datetime.

In [26]:
df_qaf['date_joined'] = pd.to_datetime(
    df_qaf['date_joined'], 
    errors='coerce',
)

df_qaf['created'] = pd.to_datetime(
    df_qaf['created'], 
    errors='coerce',
)

In [27]:
df_qaf.dtypes

birthday                datetime64[ns]
gender                          object
country_id                     float64
date_joined             datetime64[ns]
last_login                      object
age                              int64
age_range                     category
user_id                          int64
product                          int64
created                 datetime64[ns]
salary                         float64
seniority                        int64
employment_status               object
has_checking_account             int64
entry                            int64
dtype: object

# Creating report

#### Generar un csv con la siguiente información:
#### user_id, ege, age_range, genger, country_id, date_joined, last_login, salary, seniority, product, created

In [28]:
array_report = [
                'user_id', 
                'age', 
                'age_range', 
                'gender', 
                'country_id', 
                'date_joined', 
                'last_login', 
                'salary', 
                'seniority', 
                'product', 
                'created'
]
df_report = df_qaf[array_report]

In [29]:
df_report.head(5)

,user_id,age,age_range,gender,country_id,date_joined,last_login,salary,seniority,product,created
0,3073529,28,20-30,m,2.0,2018-10-06 21:23:52,2018-11-06 00:22:12,3.0,5,116,2018-10-07 00:35:19
1,3073586,32,30-40,m,2.0,2018-10-06 22:13:18,2018-10-07 01:13:19,4.0,1,58,2018-10-07 01:17:37
2,3073595,27,20-30,f,1.0,2018-10-06 22:18:25,2018-10-10 13:10:02,3.0,0,99,2018-10-07 18:31:22
3,3073604,28,20-30,f,2.0,2018-10-06 22:31:39,2019-02-01 20:48:47,2.0,1,58,2018-10-07 02:03:20
4,3073658,46,40-50,f,2.0,2018-10-07 01:20:23,2018-10-07 04:29:14,3.0,1,58,2018-10-07 04:38:50

In [30]:
df_report.to_csv('/Users/texiagonzalezcaceres/Desktop/test_destacame/df_report.csv')